&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    
    Если СтрокаТЧ = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ПересчитатьСумму(СтрокаТЧ);
    
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    
    Если СтрокаТЧ = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ПересчитатьСумму(СтрокаТЧ);
    
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(СтрокаТЧ)
    
    Количество = ?(СтрокаТЧ.Количество = Неопределено, 0, СтрокаТЧ.Количество);
    Цена       = ?(СтрокаТЧ.Цена       = Неопределено, 0, СтрокаТЧ.Цена);
    
    СтрокаТЧ.Сумма = Количество * Цена;
    
КонецПроцедуры